# arbitrary value imputation

In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#replacing nan by arbitrary value

In [10]:
df = pd.read_csv('train.csv', usecols=['Age', 'Fare', 'Survived'])

In [11]:
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [13]:
df.Age.isnull().value_counts()

False    714
True     177
Name: Age, dtype: int64

In [14]:
###Arbitray values
##this value should not be frequently present

In [17]:
def impute_nan(df, variable, arb_value):
    df[variable + str(arb_value)]=df[variable].fillna(arb_value)

In [18]:
impute_nan(df, 'Age',100)

In [19]:
df

     Survived   Age     Fare  Age100
0           0  22.0   7.2500    22.0
1           1  38.0  71.2833    38.0
2           1  26.0   7.9250    26.0
3           1  35.0  53.1000    35.0
4           0  35.0   8.0500    35.0
..        ...   ...      ...     ...
886         0  27.0  13.0000    27.0
887         1  19.0  30.0000    19.0
888         0   NaN  23.4500   100.0
889         1  26.0  30.0000    26.0
890         0  32.0   7.7500    32.0

[891 rows x 4 columns]